# RESHAPING and PIVOTING

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
data = Series(np.random.randn(10), index=[['a','a','a','b','b','b','c','c','d','d'], [1,2,3,1,2,3,1,2,2,3]])
data

a  1   -0.704829
   2    0.284197
   3   -0.503082
b  1   -0.227711
   2   -1.380675
   3   -1.424304
c  1   -1.092247
   2   -1.603134
d  2    1.904547
   3   -0.104648
dtype: float64

In [3]:
data.unstack()

          1         2         3
a -0.704829  0.284197 -0.503082
b -0.227711 -1.380675 -1.424304
c -1.092247 -1.603134       NaN
d       NaN  1.904547 -0.104648

In [4]:
data.unstack().stack()

a  1   -0.704829
   2    0.284197
   3   -0.503082
b  1   -0.227711
   2   -1.380675
   3   -1.424304
c  1   -1.092247
   2   -1.603134
d  2    1.904547
   3   -0.104648
dtype: float64

In [5]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [6]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6